Repository: NeuralNinjas-AI/AirQuality
Catalog: Datasets/archive/ELRC_417_Parallel texts from Swedish Work environment/ELRC_417_Parallel texts from Swedish Work environment [...]_dataset/261.en-sv.tmx
Source language: en
Languages: sv

source: The resulting injuries are not as extensive as for alkaline substances, though exceptions exist.
sv: Skadorna blir inte lika omfattande som för alkaliska ämnen men undantag finns.

source: Hydrofluoric acid, which is one of the most corrosive of all inorganic acids, causes intense pain on exposure.
sv: Fluorv ätesyra, som är en av de mest frätande oorganiska syrorn a, ger en intensiv smärta vid exponering.

source: Since the penetration of the acid is deep, the injury often becomes very extensive – considerably bigger than what it appears at first.
sv: Eftersom syran penetrerar djupt , blir skadan ofta mycket omfattande och betydligt större än vad den tycks vara från början.

source: Similar injuries can be caused by fluorides, which can also cause haemorr- haging in the skin.
sv: Liknande frätskador kan uppkomma av fluorid er som även kan ge blödning ar i huden.

source: Just as for the eyes, alkaline substances cause more serious injuries to the skin than do acids.
sv: Alkaliska ämnen ger även på hud allvarligare skador än syror.

source: They cause a splitting of fats and proteins which allows them to continue penetrating as long as there is some alkali left on and in the skin.
sv: De ger upphov till en spjälkning av fett och proteiner vilket medför att de kan fortsätta att penetrera så länge det finns alkali kvar på och i huden.

source: Alkali injuries usually cause intense pain and are slow to heal.
sv: Alkaliska- dor ger oftast starka smärtor och skadorna läker långsamt.

source: Hot substances and liquids
sv: Heta ämnen och vätskor

source: Hot substances and liquids cause injury because of their temperature.
sv: Heta ämnen och vätskor är skadliga på grund av sin temperatur.

source: Hot liquids, e.g. molten metal and hot oils, require particular care.
sv: Heta vätskor, t.ex. metallsmältor och heta oljor , kräver särskild försiktighet.

source: Substances easily absorbed by the skin
sv: Ämnen som lätt kan uppt as genom huden

source: Substances which are easily absorbed by the skin and can therefore cause injury are marked with an H in the Work Environment Authority’s provisions on hygienic limit values.
sv: Ämnen som lätt kan uppt as genom huden och därmed ge skada är i Arbe- tarskyddsstyrelsens föreskrifter om hygieniska gränsvärden markerade med H.

source: Certain biocides also belong in this group of substances.
sv: Föruto m dessa ämnen hör även vissa bekämpning smedel till denna grupp av ämnen.

source: Local anaesthetic
sv: Lokalbedövning

source: If splashing in the eye causes severe pain, a local anaesthetic can alleviate the pain and facilitate effective flushing.
sv: Vid svår smärta efter stänk i ögat kan lokalbedövning lindr a smärtan och underlätta effektiv ögonspolning .

source: Examples of antidotes
sv: Exempel på antido ter (motgift er)

source: An antidote is a substance which counteracts the toxicity of the harmful substance, e.g. by neutralizing it.
sv: En antidot är ett motgift som upphäver det skadliga ämnets giftigh et, t.ex. genom att neutralisera det.

source: Antidotes might be flushing fluids or gels to be used before or after flushing with water.
sv: Det kan röra sig om spolvätskor eller geler som används före respektive efter avspolning med vatten.

source: This applies to both splashing in the eyes and on the skin.
sv: Detta gäller både för stänk i ögon och på hud.

source: Occupational health care services or a hospital should be contacted in order to set up routines for antidote treatment.
sv: Kontakt bör tas med företagshälsovård eller sjukhus för att lägga upp rutin er för antidotb ehandling .

source: Alternatively, such treatment can be administered only on arrival at the hospital (the distance may be relevant).
sv: Alternativt görs denna behandling först på sjukhuset (här kan avståndet ha viss betydelse).

source: Occupational health care services or other medical expertise should therefore always be contacted before introducing the handling of any substances which may affect specific antidote treatments in the event of poisoning.
sv: Företagshälsovård eller annan medicinsk expertis bör därför alltid kontaktas innan hantering påbörj as av ämnen som kan aktualisera specifik antidotb ehandling vid förgiftning .

source: More information about antidotes in the event of splashing in the eyes, skin exposure, inhalation and consumption can be found in the chapter entitled Förgiftningar – behandlingsanvisningar (“Poisoning – directions for treatment”) in Läkemedelsboken (the medical products handbook) published by Apoteksbolaget AB.
sv: Mer infor mation om antidot er vid ögonstänk, hudexponering, inandning och förtäring finns i kapitlet Förgiftning ar – behandling sanvisningar i Lä- kemedelsboken som ges ut av Apoteksbolaget AB.
